zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_control.h
/***************************************************************************//**
* \file cy_capsense_control.h
* \version 10.0.0
*
* \brief
* This file provides the function prototypes of the Control module.
*
********************************************************************************
* \copyright
* (c) 2018-2026, Infineon Technologies AG, or an affiliate of Infineon
* Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is
* owned by Infineon Technologies AG or one of its affiliates ("Infineon")
* and is protected by and subject to worldwide patent protection, worldwide
* copyright laws, and international treaty provisions. Therefore, you may use
* this Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software. If no license
* agreement applies, then any use, reproduction, modification, translation, or
* compilation of this Software is prohibited without the express written
* permission of Infineon.
*
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
* THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
* SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
* Infineon reserves the right to make changes to the Software without notice.
* You are responsible for properly designing, programming, and testing the
* functionality and safety of your intended application of the Software, as
* well as complying with any legal requirements related to its use. Infineon
* does not guarantee that the Software will be free from intrusion, data theft
* or loss, or other breaches ("Security Breaches"), and Infineon shall have
* no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any
* application where a failure of the Product or any consequences of the use
* thereof can reasonably be expected to result in personal injury.
*******************************************************************************/


#if !defined(CY_CAPSENSE_CONTROL_H)
#define CY_CAPSENSE_CONTROL_H

#include "cy_syspm.h"
#include "cy_capsense_structure.h"
#include "cy_capsense_common.h"

#if (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3) || defined(CY_IP_M0S8MSCV3LP))

#if defined(__cplusplus)
extern "C" {
#endif

/*******************************************************************************
* Scaling Macros
*******************************************************************************/
#define CY_CAPSENSE_CDAC_TRIM_CORRECTION_NUMERATOR                        (9u)
#define CY_CAPSENSE_CDAC_TRIM_CORRECTION_DENOMINATOR                      (10u)

/*******************************************************************************
* CDAC offset Macros
*******************************************************************************/
#define CY_CAPSENSE_CDAC_CREF_OFFSET                                      (0u)
#define CY_CAPSENSE_CDAC_CFINE_OFFSET                                     (1u)
#define CY_CAPSENSE_CDAC_CCOMP_DIV_OFFSET                                 (2u)
#define CY_CAPSENSE_CDAC_CCOMP_OFFSET                                     (4u)

/*******************************************************************************
* Function Prototypes
*******************************************************************************/

/******************************************************************************/
/** \addtogroup group_capsense_high_level *//** \{ */
/******************************************************************************/

cy_capsense_status_t Cy_CapSense_Init(cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_DeInit(cy_stc_capsense_context_t * context);

cy_capsense_status_t Cy_CapSense_Enable(cy_stc_capsense_context_t * context);

cy_capsense_status_t Cy_CapSense_Save(cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_Restore(cy_stc_capsense_context_t * context);

cy_capsense_status_t Cy_CapSense_ProcessAllWidgets(
                cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_ProcessWidget(
                uint32_t widgetId, 
                cy_stc_capsense_context_t * context);

#if ((CY_CAPSENSE_DISABLE != CY_CAPSENSE_GESTURE_EN) || \
     (CY_CAPSENSE_DISABLE != CY_CAPSENSE_BALLISTIC_MULTIPLIER_EN))
    void Cy_CapSense_IncrementGestureTimestamp(cy_stc_capsense_context_t * context);
    void Cy_CapSense_SetGestureTimestamp(
                    uint32_t value, 
                    cy_stc_capsense_context_t * context);
#endif

void Cy_CapSense_Wakeup(const cy_stc_capsense_context_t * context);

cy_en_syspm_status_t Cy_CapSense_DeepSleepCallback(
                cy_stc_syspm_callback_params_t * callbackParams, 
                cy_en_syspm_callback_mode_t mode);

cy_capsense_status_t Cy_CapSense_RegisterCallback(
                cy_en_capsense_callback_event_t callbackType,
                cy_capsense_callback_t callbackFunction,
                cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_UnRegisterCallback(
                cy_en_capsense_callback_event_t callbackType,
                cy_stc_capsense_context_t * context);
/** \} */

/******************************************************************************/
/** \addtogroup group_capsense_low_level *//** \{ */
/******************************************************************************/

cy_capsense_status_t Cy_CapSense_ProcessWidgetExt(
                uint32_t widgetId, 
                uint32_t mode, 
                cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_ProcessSensorExt(
                uint32_t widgetId, 
                uint32_t sensorId, 
                uint32_t mode, 
                const cy_stc_capsense_context_t * context);
#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
void Cy_CapSense_ReadWidgetCdacParam(
                uint8_t * ptrBuffer,
                uint32_t widgetId,
                cy_stc_capsense_context_t * context);
void Cy_CapSense_WriteWidgetCdacParam(
                uint8_t * ptrBuffer,
                uint32_t widgetId,
                cy_stc_capsense_context_t * context);
void Cy_CapSense_SetWidgetCalibrationState(
                uint32_t widgetId, 
                uint32_t state,
                cy_stc_capsense_context_t * context);
#endif

#if (CY_CAPSENSE_LIQUID_LEVEL_EN)
uint8_t Cy_CapSense_IsLlwCalibrationValid (
                uint32_t widgetId,
                cy_stc_capsense_context_t * context);
#endif
/** \} */

/******************************************************************************/
/** \cond SECTION_CAPSENSE_INTERNAL */
/** \addtogroup group_capsense_internal *//** \{ */
/******************************************************************************/

cy_capsense_status_t Cy_CapSense_Initialize(
    cy_stc_capsense_context_t * context);

#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
    cy_capsense_status_t Cy_CapSense_Save_V2(
                cy_stc_capsense_context_t * context);
#elif (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
    cy_capsense_status_t Cy_CapSense_Save_V3(
                cy_stc_capsense_context_t * context);
#elif (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
    cy_capsense_status_t Cy_CapSense_Save_V3Lp(
                cy_stc_capsense_context_t * context);
#endif

#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
    cy_capsense_status_t Cy_CapSense_Restore_V2(
                cy_stc_capsense_context_t * context);
#elif (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
    cy_capsense_status_t Cy_CapSense_Restore_V3(
                cy_stc_capsense_context_t * context);
#elif (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
    cy_capsense_status_t Cy_CapSense_Restore_V3Lp(
                cy_stc_capsense_context_t * context);
#endif

/** \} \endcond */

#if defined(__cplusplus)
}
#endif

#endif /* (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3) || defined(CY_IP_M0S8MSCV3LP)) */

#endif /* CY_CAPSENSE_CONTROL_H */


/* [] END OF FILE */
